In [33]:
import pandas as pd

In [34]:
tfl_df = pd.read_csv('tfl-daily-cycle-hires.csv')

In [35]:
tfl_df

             Day  Number of Bicycle Hires  Unnamed: 2
0     30/07/2010                   6897.0         NaN
1     31/07/2010                   5564.0         NaN
2     01/08/2010                   4303.0         NaN
3     02/08/2010                   6642.0         NaN
4     03/08/2010                   7966.0         NaN
...          ...                      ...         ...
4076  26/09/2021                  45120.0         NaN
4077  27/09/2021                  32167.0         NaN
4078  28/09/2021                  32539.0         NaN
4079  29/09/2021                  39889.0         NaN
4080  30/09/2021                  34070.0         NaN

[4081 rows x 3 columns]

In [36]:
tfl_df.info

<bound method DataFrame.info of              Day  Number of Bicycle Hires  Unnamed: 2
0     30/07/2010                   6897.0         NaN
1     31/07/2010                   5564.0         NaN
2     01/08/2010                   4303.0         NaN
3     02/08/2010                   6642.0         NaN
4     03/08/2010                   7966.0         NaN
...          ...                      ...         ...
4076  26/09/2021                  45120.0         NaN
4077  27/09/2021                  32167.0         NaN
4078  28/09/2021                  32539.0         NaN
4079  29/09/2021                  39889.0         NaN
4080  30/09/2021                  34070.0         NaN

[4081 rows x 3 columns]>

In [37]:
tfl_df.columns

Index(['Day', 'Number of Bicycle Hires', 'Unnamed: 2'], dtype='object')

In [38]:
tfl_df.describe

<bound method NDFrame.describe of              Day  Number of Bicycle Hires  Unnamed: 2
0     30/07/2010                   6897.0         NaN
1     31/07/2010                   5564.0         NaN
2     01/08/2010                   4303.0         NaN
3     02/08/2010                   6642.0         NaN
4     03/08/2010                   7966.0         NaN
...          ...                      ...         ...
4076  26/09/2021                  45120.0         NaN
4077  27/09/2021                  32167.0         NaN
4078  28/09/2021                  32539.0         NaN
4079  29/09/2021                  39889.0         NaN
4080  30/09/2021                  34070.0         NaN

[4081 rows x 3 columns]>

In [39]:
tfl_df.info

<bound method DataFrame.info of              Day  Number of Bicycle Hires  Unnamed: 2
0     30/07/2010                   6897.0         NaN
1     31/07/2010                   5564.0         NaN
2     01/08/2010                   4303.0         NaN
3     02/08/2010                   6642.0         NaN
4     03/08/2010                   7966.0         NaN
...          ...                      ...         ...
4076  26/09/2021                  45120.0         NaN
4077  27/09/2021                  32167.0         NaN
4078  28/09/2021                  32539.0         NaN
4079  29/09/2021                  39889.0         NaN
4080  30/09/2021                  34070.0         NaN

[4081 rows x 3 columns]>

In [40]:
tfl_df.dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

In [41]:
tfl_df.sample

<bound method NDFrame.sample of              Day  Number of Bicycle Hires  Unnamed: 2
0     30/07/2010                   6897.0         NaN
1     31/07/2010                   5564.0         NaN
2     01/08/2010                   4303.0         NaN
3     02/08/2010                   6642.0         NaN
4     03/08/2010                   7966.0         NaN
...          ...                      ...         ...
4076  26/09/2021                  45120.0         NaN
4077  27/09/2021                  32167.0         NaN
4078  28/09/2021                  32539.0         NaN
4079  29/09/2021                  39889.0         NaN
4080  30/09/2021                  34070.0         NaN

[4081 rows x 3 columns]>

In [42]:
tfl_df.shape

(4081, 3)

In [43]:
tfl_df.drop(columns='Unnamed: 2', inplace = True)

In [44]:
tfl_df

             Day  Number of Bicycle Hires
0     30/07/2010                   6897.0
1     31/07/2010                   5564.0
2     01/08/2010                   4303.0
3     02/08/2010                   6642.0
4     03/08/2010                   7966.0
...          ...                      ...
4076  26/09/2021                  45120.0
4077  27/09/2021                  32167.0
4078  28/09/2021                  32539.0
4079  29/09/2021                  39889.0
4080  30/09/2021                  34070.0

[4081 rows x 2 columns]

In [45]:
tfl_df.dtypes

Day                         object
Number of Bicycle Hires    float64
dtype: object

In [46]:
#tfl_df['Day']=pd.to_datetime(tfl_df['Day'],format="%d-%m-%Y")

In [47]:
tfl_df

             Day  Number of Bicycle Hires
0     30/07/2010                   6897.0
1     31/07/2010                   5564.0
2     01/08/2010                   4303.0
3     02/08/2010                   6642.0
4     03/08/2010                   7966.0
...          ...                      ...
4076  26/09/2021                  45120.0
4077  27/09/2021                  32167.0
4078  28/09/2021                  32539.0
4079  29/09/2021                  39889.0
4080  30/09/2021                  34070.0

[4081 rows x 2 columns]

In [52]:
#tfl_df['Month']=pd.to_datetime(tfl_df['Day'],format="%b")
tfl_df["Day"] = pd.to_datetime(tfl_df["Day"], dayfirst=True, errors="coerce")

In [53]:
tfl_df

            Day  Number of Bicycle Hires
0    2010-07-30                   6897.0
1    2010-07-31                   5564.0
2    2010-08-01                   4303.0
3    2010-08-02                   6642.0
4    2010-08-03                   7966.0
...         ...                      ...
4076 2021-09-26                  45120.0
4077 2021-09-27                  32167.0
4078 2021-09-28                  32539.0
4079 2021-09-29                  39889.0
4080 2021-09-30                  34070.0

[4081 rows x 2 columns]

In [57]:
tfl_df['Month']=tfl_df['Day'].dt.strftime('%b')

In [55]:
tfl_df

            Day  Number of Bicycle Hires Month
0    2010-07-30                   6897.0   Jul
1    2010-07-31                   5564.0   Jul
2    2010-08-01                   4303.0   Aug
3    2010-08-02                   6642.0   Aug
4    2010-08-03                   7966.0   Aug
...         ...                      ...   ...
4076 2021-09-26                  45120.0   Sep
4077 2021-09-27                  32167.0   Sep
4078 2021-09-28                  32539.0   Sep
4079 2021-09-29                  39889.0   Sep
4080 2021-09-30                  34070.0   Sep

[4081 rows x 3 columns]

In [58]:
tfl_df['Year']=tfl_df['Day'].dt.year

In [62]:
tfl_df

            Day  Number of Bicycle Hires Month  Year
0    2010-07-30                   6897.0   Jul  2010
1    2010-07-31                   5564.0   Jul  2010
2    2010-08-01                   4303.0   Aug  2010
3    2010-08-02                   6642.0   Aug  2010
4    2010-08-03                   7966.0   Aug  2010
...         ...                      ...   ...   ...
4076 2021-09-26                  45120.0   Sep  2021
4077 2021-09-27                  32167.0   Sep  2021
4078 2021-09-28                  32539.0   Sep  2021
4079 2021-09-29                  39889.0   Sep  2021
4080 2021-09-30                  34070.0   Sep  2021

[4081 rows x 4 columns]

In [66]:
tfl_df.dtypes

Day                        datetime64[ns]
Number of Bicycle Hires           float64
Month                              object
Year                                int32
dtype: object

In [61]:
tfl_df['YYYY-MMM']=tfl_df['Year']+'-'+tfl_df['Month']

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('int32'), dtype('<U1')) -> None